app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "name", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "MyText"], ["created_at", Tue, 19 Nov 2013 17:25:03 UTC +00:00], ["name", "MyString"], ["title", "MyString"], ["updated_at", Tue, 19 Nov 2013 17:25:03 UTC +00:00]]